{ "listToTrain": [
    "hi",
    "hi, how can help you",
    "What is your name?", "I am Chatbot, your virtual assistant.",
    "How are you?", "I'm just a program, but I'm here to help you!",
    "What can you do?", "I can answer your questions, provide information, and assist with tasks.",
    "Where are you from?", "I exist in the digital world, ready to help you wherever you are.",
    "How old are you?", "I don't age, but I was created to assist you anytime.",
    "Do you have feelings?", "No, I don’t have feelings, but I aim to understand yours to assist better.",
    "What is the meaning of life?", "That’s a deep question! Many say it’s about love, growth, and connection.",
    "Can you tell me a joke?", "Sure! Why don’t scientists trust atoms? Because they make up everything!",
    "What’s 2+2?", "2+2 equals 4.",
    "What is the weather like?", "Tell me your location, and I can find the weather for you.",
    "Why is the sky blue?", "The sky looks blue because of the way sunlight interacts with the atmosphere.",
    "How do I stay happy?", "Focus on the positive, connect with loved ones, and pursue your passions.",
    "Can you sing?", "I can’t sing, but I can suggest some great songs for you.",
    "What’s your favorite food?", "I don’t eat, but I’ve heard pizza is a favorite for many.",
    "What’s your favorite color?", "I don’t have a favorite, but I think all colors are beautiful.",
    "What time is it?", "Let me know your location, and I can tell you the current time.",
    "How do I make friends?", "Be kind, listen well, and show genuine interest in others.",
    "What’s your favorite movie?", "I don’t watch movies, but I can recommend popular ones if you’d like.",
    "Why do people dream?", "Dreams help the brain process emotions and experiences while you sleep.",
    "Can you tell me a story?", "Of course! Once upon a time, there was a curious person who met a chatbot...",
    "What is gravity?", "Gravity is the force that pulls objects toward each other, like us to the Earth.",
    "Why do we have seasons?", "Seasons happen because of the Earth’s tilt as it orbits the Sun.",
    "What’s the largest animal?", "The blue whale is the largest animal on Earth.",
    "What’s your favorite book?", "I don’t read books, but I can recommend classics like '1984' or 'To Kill a Mockingbird.'",
    "Can you help me learn?", "Absolutely! Let me know what topic you’d like to explore.",
    "Why do people get sick?", "People get sick due to infections, stress, or other health issues.",
    "What is love?", "Love is a deep feeling of care, connection, and affection for someone or something.",
    "How do I cook pasta?", "Boil water, add salt, cook pasta until tender, then drain and enjoy!",
    "What is the speed of light?", "The speed of light is approximately 299,792 kilometers per second.",
    "What’s the capital of France?", "The capital of France is Paris.",
    "How can I improve myself?", "Set clear goals, keep learning, and stay consistent in your efforts.",
    "Can you dance?", "I can’t dance, but I can guide you to learn some moves!",
    "Why do we have rainbows?", "Rainbows form when light refracts and reflects in water droplets.",
    "What’s the meaning of dreams?", "Dreams can represent subconscious thoughts, desires, or emotions.",
    "How do I deal with stress?", "Practice deep breathing, exercise, and talk to someone you trust.",
    "Can you solve riddles?", "I’d love to try! Share a riddle with me.",
    "What is a star?", "A star is a massive ball of gas, primarily hydrogen and helium, that emits light and heat.",
    "Why do humans laugh?", "Laughter is a response to humor and helps connect people socially.",
    "What’s your purpose?", "My purpose is to assist you and make your day easier.",
    "What makes people happy?", "Happiness often comes from love, gratitude, and meaningful experiences.",
    "What is the moon made of?", "The moon is made of rock, primarily basalt and other silicates.",
    "Why do we sleep?", "Sleep helps the body rest and the brain process information and memories.",
    "How do I stay healthy?", "Eat well, exercise, sleep enough, and manage stress effectively.",
    "What is the universe?", "The universe is everything that exists: space, time, matter, and energy.",
    "Can you keep secrets?", "I’m here to help, but for privacy, don’t share personal details with me.",
    "What sizes of shirts do you offer?", "We offer shirts in sizes S, M, L, XL, and XXL.",
    "Are your shirts true to size?", "Yes, our shirts are true to size. We also provide a size guide on the product page.",
    "What materials are the shirts made from?", "Our shirts are made from high-quality cotton, polyester, or blends.",
    "Do you have formal shirts?", "Yes, we have a wide range of formal shirts. Use the filters to narrow your search.",
    "How do I find casual pants?", "You can search 'casual pants' or use the category filters on our website.",
    "What waist sizes are available for pants?", "We offer pants in waist sizes ranging from 28 to 44 inches.",
    "Do your pants come in different lengths?", "Yes, we provide pants in short, regular, and long lengths.",
    "Can I return pants if they don't fit?", "Yes, you can return or exchange pants within 30 days if they don’t fit.",
    "What brands of watches do you sell?", "We sell a variety of watch brands, including XYZ, ABC, and more.",
    "Are your watches water-resistant?", "Many of our watches are water-resistant. Check the product details for specific information.",
    "Do you sell smartwatches?", "Yes, we have a range of smartwatches available in the 'Watches' section.",
    "How can I filter watches by price?", "Use the price filter on the left-hand side of the watches category page.",
    "Do you have running shoes?", "Yes, we have a dedicated section for running shoes in various styles and brands.",
    "What shoe sizes do you offer?", "Our shoe sizes range from US size 5 to 13.",
    "Are the shoes suitable for hiking?", "We have a specific collection of hiking shoes. Check the 'Outdoor Shoes' section.",
    "Do your shoes have a warranty?", "Yes, most of our shoes come with a manufacturer’s warranty. Details are on the product page.",
    "How do I add an item to my cart?", "Click the 'Add to Cart' button on the product page after selecting size and color.",
    "Can I save items for later?", "Yes, you can use the 'Wishlist' feature to save items for later.",
    "How do I view my cart?", "Click on the cart icon in the top right corner of the website to view your cart.",
    "Can I remove items from my cart?", "Yes, click the 'Remove' button next to the item in your cart.",
    "How do I apply a discount code?", "Enter the discount code in the 'Promo Code' field at checkout and click 'Apply'.",
    "What payment methods do you accept?", "We accept credit/debit cards, PayPal, and net banking.",
    "Can I pay cash on delivery?", "Yes, cash on delivery is available for select locations.",
    "How do I place an order?", "After adding items to your cart, proceed to checkout, enter your details, and confirm payment.",
    "How long does delivery take?", "Delivery typically takes 3-7 business days, depending on your location.",
    "Is there a shipping fee?", "Shipping is free for orders above $50. Otherwise, a standard fee applies.",
    "Can I track my order?", "Yes, use the tracking link sent to your email to monitor your order status.",
    "What is your return policy?", "We accept returns within 30 days for unworn and undamaged items.",
    "How do I initiate a return?", "Go to 'My Orders,' select the item, and click 'Return' to start the process.",
    "Are there any discounts on shirts?", "Yes, check our 'Deals' section for discounts on shirts.",
    "Do you offer gift wrapping?", "Yes, you can add gift wrapping at checkout for a small fee.",
    "How do I find black shoes?", "Search for 'black shoes' or use the color filter in the 'Shoes' section.",
    "Can I sort items by popularity?", "Yes, use the 'Sort by Popularity' option on the category page.",
    "Are there bundle offers on pants?", "Yes, check our 'Bundles' section for combo deals on pants.",
    "What are the trending watches?", "Visit the 'Trending Now' section for the latest popular watches.",
    "Do you have vegan leather shoes?", "Yes, we have a range of vegan leather shoes. Look for the 'Eco-Friendly' tag.",
    "Can I exchange a shirt for a different size?", "Yes, you can exchange a shirt within 30 days. Visit 'My Orders' to initiate an exchange.",
    "How do I check if an item is in stock?", "The product page will display stock availability next to the item.",
    "Can I cancel an order?", "You can cancel your order within 2 hours of placing it by going to 'My Orders.'",
    "Do you have a loyalty program?", "Yes, sign up for our rewards program to earn points on every purchase.",
    "Can I chat with customer support?", "Yes, click the 'Chat with Us' button on the website for assistance.",
    "Do you offer same-day delivery?", "Same-day delivery is available in select cities for an additional fee.",
    "What brands of shirts do you sell?", "We sell popular brands like BrandX, BrandY, and more.",
    "Are your shoes comfortable?", "Yes, our shoes are designed for comfort and durability.",
    "What’s the warranty on watches?", "Most of our watches come with a 1-year warranty. Check the product details for specifics.",
    "Can I filter items by material?", "Yes, use the material filter on the left-hand side of the category page.",
    "Do you sell kids' clothing?", "Yes, we have a dedicated section for kids' clothing, including shirts and pants.",
    "What are your store hours?", "Our store is open 24/7 online for your convenience!",
    "Do you offer free shipping?", "Yes, we offer free shipping on orders over $50.",
    "How can I track my order?", "You can track your order using the tracking number sent to your email.",
    "What is your return policy?", "We accept returns within 30 days of purchase. Items must be unused and in original packaging.",
    "Can I change my shipping address after placing an order?", "Yes, you can change your shipping address within 2 hours of placing the order by contacting customer support.",
    "What payment methods do you accept?", "We accept credit/debit cards, PayPal, and Google Pay.",
    "Do you ship internationally?", "Yes, we ship to most countries. Additional shipping charges may apply.",
    "How do I apply a discount code?", "You can apply a discount code at checkout in the 'Promo Code' field.",
    "Do you have a size guide?", "Yes, you can find the size guide on each product page under the size selection area.",
    "What happens if I receive a damaged item?", "If you receive a damaged item, please contact our support team with pictures of the item, and we’ll resolve the issue promptly.",
    "Can I cancel my order?", "You can cancel your order within 1 hour of placing it. Contact customer support to request a cancellation.",
    "Do you offer gift wrapping?", "Yes, we offer gift wrapping for an additional fee at checkout.",
    "How can I contact customer service?", "You can contact customer service via email at support@example.com or call us at 1-800-123-4567.",
    "What is the estimated delivery time?", "Delivery typically takes 3-7 business days for domestic orders and 10-15 business days for international orders.",
    "Do you offer price matching?", "Yes, we offer price matching if you find the same item for less within 14 days of purchase.",
    "What should I do if I forgot my password?", "Click 'Forgot Password' on the login page to reset your password.",
    "How can I leave a review for a product?", "You can leave a review by going to the product page and clicking 'Write a Review'.",
    "Are your products eco-friendly?", "Many of our products are eco-friendly and sustainably sourced. Look for the 'Eco-Friendly' tag on product pages.",
    "Do you offer bulk discounts?", "Yes, we offer bulk discounts for orders over a certain quantity. Contact us for more details.",
    "What happens if my package is lost?", "If your package is lost, contact us immediately. We’ll investigate and send a replacement if necessary.",
    "How can I search for products?", "You can use the search bar at the top of the page and type in the product name or category.",
    "Do you offer free shipping?", "Yes, we offer free shipping on orders over $50.",
    "How do I track my order?", "You can track your order by clicking on the 'Track Order' link in your confirmation email.",
    "What is your return policy?", "We accept returns within 30 days of purchase for unused and undamaged items.",
    "How can I add items to my cart?", "Click the 'Add to Cart' button on the product page after selecting your preferences.",
    "Can I save items for later?", "Yes, use the 'Wishlist' feature to save items you want to buy later.",
    "How do I view my cart?", "Click on the cart icon in the top-right corner of the website to view your cart.",
    "Can I remove items from my cart?", "Yes, click the 'Remove' button next to the item in your cart.",
    "What payment methods do you accept?", "We accept credit/debit cards, PayPal, and net banking.",
    "Can I pay with cash on delivery?", "Yes, cash on delivery is available for select locations.",
    "How do I place an order?", "Add items to your cart, proceed to checkout, enter your details, and confirm payment.",
    "How long does delivery take?", "Delivery typically takes 3-7 business days, depending on your location.",
    "Can I cancel my order?", "You can cancel your order within 2 hours of placing it by contacting customer support.",
    "How do I apply a discount code?", "Enter the discount code in the 'Promo Code' field at checkout and click 'Apply'.",
    "What should I do if I receive a damaged item?", "Contact customer support with pictures of the damaged item, and we’ll assist you with a replacement or refund.",
    "Do you sell gift cards?", "Yes, we offer digital gift cards that can be purchased from our website.",
    "How can I check if a product is in stock?", "The product page displays stock availability under the price.",
    "Do you offer same-day delivery?", "Same-day delivery is available in select cities for an additional fee.",
    "Can I exchange an item?", "Yes, you can exchange items within 30 days. Visit 'My Orders' to initiate an exchange.",
    "What are your customer support hours?", "Our customer support team is available 24/7 to assist you.",
    "Do you sell kids' products?", "Yes, we have a dedicated section for kids' products, including clothing, toys, and accessories.",
    "What is your warranty policy?", "Most of our products come with a 1-year manufacturer’s warranty. Check the product details for specifics.",
    "Can I filter products by price?", "Yes, use the price filter on the left-hand side of the category page.",
    "How do I find discounts?", "Check the 'Deals' section on our website for the latest discounts and offers.",
    "Can I shop without creating an account?", "Yes, you can shop as a guest, but creating an account allows you to track orders and save preferences.",
    "Do you offer bulk discounts?", "Yes, bulk discounts are available for large orders. Contact customer support for more details.",
    "How do I write a product review?", "Go to the product page and click 'Write a Review' to share your feedback.",
    "What happens if my package is lost?", "If your package is lost, contact customer support, and we’ll resolve the issue promptly.",
    "Are there any eco-friendly products?", "Yes, look for the 'Eco-Friendly' tag on product pages to find sustainable options.",
    "How do I update my account details?", "Log in to your account, go to 'Settings,' and update your information.",
    "Can I track my order without an account?", "Yes, use the tracking link sent to your email to track your order.",
    "Do you have a loyalty program?", "Yes, join our rewards program to earn points on every purchase.",
    "Can I shop from my mobile device?", "Yes, our website is mobile-friendly, and we also have a mobile app for easier shopping.",
    "What brands do you offer?", "We offer a variety of brands across all categories. Use the brand filter to find specific ones.",
    "Are there any products on sale?", "Yes, check our 'Sale' section for discounted items.",
    "Do you offer personalization services?", "Yes, some products can be personalized. Look for the 'Personalize' option on the product page.",
    "What should I do if I forget my password?", "Click 'Forgot Password' on the login page to reset your password.",
    "Can I return items purchased on sale?", "Yes, sale items can be returned within the same 30-day return policy unless otherwise specified.",
    "What is your contact number?", "You can reach us at 1-800-123-4567.",
    "How do I search for specific categories?", "Use the menu at the top of the page to browse categories like clothing, electronics, and more.",
    "Can I sort products by rating?", "Yes, use the sorting option to organize products by customer rating.",
    "What are the shipping charges?", "Shipping is free for orders over $50. For smaller orders, standard rates apply.",
    "How can I change my shipping address?", "Go to 'My Orders' and edit the shipping address within 2 hours of placing the order.",
    "What should I do if my payment fails?", "Try again with a different payment method or contact your bank for assistance.",
    "How do I know my order is confirmed?", "You will receive an email confirmation after placing your order.",
    "What are the best-selling products?", "Visit our 'Best Sellers' section to see popular items.",
    "Can I contact the seller directly?", "For most products, you can only contact customer support. We’ll liaise with the seller if needed.",
    "How do I sign up for the newsletter?", "Scroll to the bottom of the page and enter your email in the newsletter subscription box.",
    "Do you ship internationally?", "Yes, we ship to most countries. Additional shipping charges may apply.",
    "Can I change the payment method after placing an order?", "Unfortunately, payment methods cannot be changed after the order is placed."
]
} 
